In [55]:
import pandas as pd
import numpy as np

In [49]:
qqq = pd.read_csv('./NASDAQ Composite Historical Data.csv')[['Date','R']]
tlt = pd.read_csv('./VUSTX.csv')[['Date','R']]

In [ ]:
phase = 1(0,1,2,3) 
sellFee = 0.002
buyFee = 0.002
taxRate = 0.22
taxSum = 0

In [50]:
qqq.head()

        Date       R
0  28-Feb-20   0.01%
1  27-Feb-20  -4.61%
2  26-Feb-20   0.17%
3  25-Feb-20  -2.77%
4  24-Feb-20  -3.71%

In [51]:
tlt.head()

         Date        R
0  1986-05-19  -0.200%
1  1986-05-20  -0.200%
2  1986-05-21   1.002%
3  1986-05-22  -0.198%
4  1986-05-23   0.199%

In [52]:
tlt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8515 entries, 0 to 8514
Data columns (total 2 columns):
Date    8515 non-null object
R       8515 non-null object
dtypes: object(2)
memory usage: 133.2+ KB

In [53]:
qqq.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5323 entries, 0 to 5322
Data columns (total 2 columns):
Date    5323 non-null object
R       5323 non-null object
dtypes: object(2)
memory usage: 83.3+ KB

In [74]:
tlt['Date'] = pd.to_datetime(tlt['Date'])
qqq['Date'] = pd.to_datetime(qqq['Date'])
tlt['R'] = tlt['R'].str.replace('%','').astype(np.float64)
qqq['R'] = qqq['R'].str.replace('%','').astype(np.float64)

In [75]:
tlt.info()
qqq.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8515 entries, 0 to 8514
Data columns (total 2 columns):
Date    8515 non-null datetime64[ns]
R       8515 non-null float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 133.2 KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5323 entries, 0 to 5322
Data columns (total 2 columns):
Date    5323 non-null datetime64[ns]
R       5323 non-null float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 83.3 KB

In [76]:
qqq.sample(10)

           Date     R
1565 2013-12-09  0.15
3243 2007-04-12  0.85
2057 2011-12-22  0.83
5021 2000-03-14 -4.09
1757 2013-03-07  0.30
642  2017-08-09 -0.28
3131 2007-09-20 -0.46
2729 2009-04-27 -0.88
4831 2000-12-12 -2.76
3407 2006-08-15  2.22

In [18]:
tlt['Date'].dt.year

0       1986
1       1986
2       1986
3       1986
4       1986
        ...
8510    2020
8511    2020
8512    2020
8513    2020
8514    2020
Name: Date, Length: 8515, dtype: int64

In [19]:
qqq['Date'] = pd.to_datetime(qqq['Date'])
qqq.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5323 entries, 0 to 5322
Data columns (total 7 columns):
Date        5323 non-null datetime64[ns]
Price       5323 non-null object
Open        5323 non-null object
High        5323 non-null object
Low         5323 non-null object
Vol.        5323 non-null object
Change %    5323 non-null object
dtypes: datetime64[ns](1), object(6)
memory usage: 291.2+ KB

In [21]:
qqq['Date'].dt.year

0       2020
1       2020
2       2020
3       2020
4       2020
        ...
5318    1999
5319    1999
5320    1999
5321    1999
5322    1999
Name: Date, Length: 5323, dtype: int64

In [22]:
qqq["Date_1m"] = qqq["Date"] + pd.DateOffset(months=1)

In [23]:
qqq.describe()

,Date,Price,Open,High,Low,Vol.,Change %,Date_1m
count,5323,5323,5323,5323,5323,5323,5323,5323
unique,5323,5277,5272,5271,5285,3180,810,5240
top,2000-10-13 00:00:00,"2,344.99","5,096.34","2,071.52","2,165.79",-,0.27%,2013-02-28 00:00:00
freq,1,2,2,2,2,1873,35,4
first,1999-01-04 00:00:00,NaN,NaN,NaN,NaN,NaN,NaN,1999-02-04 00:00:00
last,2020-02-28 00:00:00,NaN,NaN,NaN,NaN,NaN,NaN,2020-03-28 00:00:00

In [44]:
qqq.loc[(qqq['Date'].dt.day == 29) & (qqq['Date'].dt.month == 2)]

,Date,Price,Open,High,Low,Vol.,Change %,Date_1m
1007,2016-02-29,"4,557.95","4,585.30","4,619.90","4,557.46",565.97M,-0.71%,2016-03-29
2012,2012-02-29,"2,966.89","2,991.67","3,000.11","2,961.77",598.32M,-0.67%,2012-03-29
3020,2008-02-29,"2,271.48","2,309.06","2,311.23","2,264.97",1.10B,-2.58%,2008-03-29
5031,2000-02-29,"4,696.69","4,646.64","4,698.46","4,637.17",-,2.60%,2000-03-29

In [36]:
qqq['Date'].dt.day == 28

0        True
1       False
2       False
3       False
4       False
        ...
5318    False
5319    False
5320    False
5321    False
5322    False
Name: Date, Length: 5323, dtype: bool

### 기본설정
1. 시작일 선정(양쪽다 데이터가 있는 최소값)
2. 변수리스트
-> tlt, qqq, result
    result(date, phase, returnRate, balance, qqqPosition, tltPosition, taxSum, fee, maxBalance, drawdown)
3. 상수(세팅값)리스트() 선언후 바뀌지 않는 변수
->  phase = 1(0,1,2,3), 
    sellFee = 0.002, 
    buyFee = 0.002,
    taxRate = 0.22,
    taxSum = 0,
    (phase0Cnt = 0, phase1Period = 1m, phase1ThresholdRate = 2, phase1QqqPosition = 1, phase1TltPosition = 0) 
    phase1Cnt = 1, phase1Period = 1m, phase1ThresholdRate = 2, phase1QqqPosition = 0.9, phase1TltPosition = 0.1,
    phase2Cnt = 1, phase2Period = 1m, phase2ThresholdRate = 3, phase2QqqPosition = 0, phase2TltPosition = 1,
    phase3Cnt = 4, phase3Period = 2m, phase3ThresholdRate = 3, phase3QqqPosition = 0, phase3TltPosition = 1